app/Http/Controllers/Owner/ImageController.php

    public function __construct()
    {
        $this->middleware('auth:owners');

        $this->middleware(function ($request, $next) {

            $id = $request->route()->parameter('image');
            if(!is_null($id)){
                $imagesOwnerId = Image::findOrFail($id)->owner->id;
---
select * from `owners` where `owners`.`id` = 1 and `owners`.`deleted_at` is null limit 1

    public function index()
    {
        $images = Image::where('owner_id', Auth::id())
        ->orderBy('updated_at','desc')
        ->paginate(20);
---
select * from `images` where `owner_id` = 1 order by `updated_at` desc limit 20 offset 0
select count(*) as aggregate from `images` where `owner_id` = 1