app/Http/Controllers/Owner/ProductController.php

    public function __construct()
    {
        $this->middleware('auth:owners');

        $this->middleware(function ($request, $next) {

            $id = $request->route()->parameter('product');
            if(!is_null($id)){
                $productsOwnerId = Product::findOrFail($id)->shop->owner->id;
                $productId = (int)$productsOwnerId;
                if($productId !== Auth::id()){
                    abort(404);
                }
            }
            return $next($request);
        });
---
select * from `owners` where `owners`.`id` = 1 and `owners`.`deleted_at` is null limit 1
select * from `shops` where `shops`.`id` = 1 limit 1
select * from `products` where `products`.`shop_id` = 1 and `products`.`shop_id` is not null
select * from `shops` where `shops`.`owner_id` = 1 and `shops`.`owner_id` is not null limit 1

    public function index()
    {
        //$products = Owner::FindOrFail(Auth::id())->shop->product;

        $ownerInfo = Owner::with('shop.product.imageFirst')
        ->where('id', Auth::id())->get();
---
select * from `images` where `images`.`id` in (1, 2, 3, 4, 5)
select * from `owners` where `id` = 1 and `owners`.`deleted_at` is null
select * from `products` where `products`.`shop_id` in (1)
select * from `shops` where `shops`.`owner_id` in (1)

    public function create()
    {
        $shops = Shop::where('owner_id', Auth::id())
        ->select('id', 'name')
        ->get();

        $images = Image::where('owner_id', Auth::id())
        ->select('id', 'title', 'filename')
        ->orderBy('updated_at', 'desc')
        ->get();

        $categories = PrimaryCategory::with('secondary')
        ->get();
---
select `id`, `name` from `shops` where `owner_id` = 1
select `id`, `title`, `filename` from `images` where `owner_id` = 1 order by `updated_at` desc
select * from `primary_categories`

    public function edit($id)
    {
        $product =Product::findOrFail($id);
        $quantity = Stock::where('product_id' , $product->id)
        ->sum('quantity');

        $shops = Shop::where('owner_id', Auth::id())
        ->select('id', 'name')
        ->get();

        $images = Image::where('owner_id', Auth::id())
        ->select('id', 'title', 'filename')
        ->orderBy('updated_at', 'desc')
        ->get();

        $categories = PrimaryCategory::with('secondary')
        ->get();
---
select sum(`quantity`) as aggregate from `t_stocks` where `product_id` = 3
select `id`, `name` from `shops` where `owner_id` = 1
select `id`, `title`, `filename` from `images` where `owner_id` = 1 order by `updated_at` desc
select * from `primary_categories`

    public function update(ProductRequest $request, $id)
    {
        $request->validate([
            'current_quantity' => ['required', 'integer'],
        ]);

        $product = Product::findOrFail($id);
        $quantity = Stock::where('product_id' , $product->id)
        ->sum('quantity');
---
select sum(`quantity`) as aggregate from `t_stocks` where `product_id` = 1