app/Http/Controllers/Admin/OwnersController.php

    public function index()
    {
        // $date_now = Carbon::now();
        // $date_parse = Carbon::parse(now());
        // echo $date_now->year;
        // echo $date_parse;

        // $e_all = Owner::all();
        // $q_get = DB::table('owners')->select('name','created_at')->get();
        //$q_first = DB::table('owners')->select('name')->first();
        // $c_test = collect([
        //     'name'=>'てすと'
        // ]);

        //dd($e_all, $q_get, $q_first, $c_test);

        //var_dump($q_get);
        $owners = Owner::select('id', 'name', 'email', 'created_at')->get();
---
select `id`, `name`, `email`, `created_at` from `owners` where `owners`.`deleted_at` is null

    public function destroy($id)
    {
        Owner::FindorFail($id)->delete(); //ソフトデリート
---
update `owners` set `deleted_at` = '2021-11-27 20:59:27', `owners`.`updated_at` = '2021-11-27 20:59:27' where `id` = 2

    public function expiredOwnerIndex(){
        $expiredOwners = Owner::onlyTrashed()->get();
---
select * from `owners` where `owners`.`deleted_at` is not null

    public function expiredOwnerDestroy($id){
        Owner::onlyTrashed()->findOrFail($id)->forceDelete();
---
delete from `owners` where `id` = 1
select * from `owners` where `owners`.`deleted_at` is not null and `owners`.`id` = '1' limit 1